app/controllers/dancehall_controller.rb

SELECT * FROM `users` WHERE (religion = 1 AND cast = 1 AND subcast = 1 AND mothertongue = 'Malayalam' AND job = 'Engineer' AND sex = 'Female')
---
        flash[:notice]= "You can't skip this part"
      end

@mate = User.find(:all,:conditions => ["religion = ? AND cast = ? AND subcast = ? AND job = ?   AND mothertongue = ?  AND sex = ?",religion,cast,subcast,job,mothertongue, "Female"])