app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `address`, `subcast`, `created_at`, `dob`, `photo_file_size`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `mother`, `mother_job`, `photo_file_name`, `father_job`, `weight`, `complexion`, `photo_content_type`, `search_cast`, `salary`, `photo_updated_at`, `sex`, `dateofbirth`, `remember_token`, `job`, `height`, `siblings`, `religion`, `search_religion`, `search_subcast`, `search_sex`, `search_job`, `login`, `mothertongue`, `cast`, `status`, `email`, `father`, `built`, `search_mothertongue`) VALUES('', 'e288928aa778fb73f503d193e3267f1310b29b47', NULL, NULL, '2010-10-19 11:47:12', NULL, NULL, '0f241bbea1975bd7633dd79c608a2d3617882a50', NULL, '2010-10-19 11:47:12', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'sajana', NULL, NULL, NULL, 'sajana@gmail.com', NULL, NULL, NULL)

 def save_personal_details
    @user= current_user
    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `updated_at` = '2010-10-20 08:56:11', `mother_job` = 'housewife', `mother` = 'ma', `photo_file_name` = 'Hummer_H1_1630.jpg', `address` = 'wallookaran', `name` = 'Sonia Agarwal', `salary` = 74667, `cast` = 7, `search_job` = 7, `height` = 135, `search_mothertongue` = 5, `siblings` = 1, `sex` = 'Female', `photo_updated_at` = '2010-10-20 08:56:11', `father` = 'fa', `religion` = 1, `dateofbirth` = '1989-02-17', `weight` = 123, `photo_file_size` = 278148, `father_job` = 'business ', `photo_content_type` = 'image/jpeg' WHERE `id` = 30

 def save_search_criteria
   @user=current_user
   if @user.update_attributes(params[:user])
---
UPDATE `users` SET `updated_at` = '2010-10-19 12:03:54', `search_cast` = 0, `search_job` = 2, `search_subcast` = 0, `search_religion` = 0, `search_mothertongue` = 0 WHERE `id` = 1